Thinking：
1、机器学习中的监督学习、非监督学习、强化学习有何区别，简要说出三者之间的区别

监督学习有标签数据，半监督学习无标签数据；
强化学习不像监督学习一样没有训练数据的输出值，只有奖励值，是延后给出的反馈值；
强化学习不像非监督学习一样无任何输出值以及奖励值，且强化学习的反馈值与数据特征有前后依赖关系


2、什么是策略网络，价值网络，有何区别，简要说明两者之间的区别

策略网络根据状态输出是一个动作的概率分布，使用神经网络。
价值网络通过计算目前状态s的累积分数的期望，给状态赋予一个分数，每个状态经历整个数值网络；输出是一个kennel获胜的数值，价值训练时一种回归

3、请简述MCTS（蒙特卡洛树搜索）的原理，4个步骤Select, Expansion，Simluation，Backpropagation是如何操作的并简要说明4个步骤的原理

蒙特卡洛树搜索结合了随机模拟的一般性和树搜索的准确性。
主要步骤：
Select，从根节点开始，按一定策略，搜索到叶子结点
Expansion，对叶子结点扩展一个或多个合法的子节点
Simluation，对子节点采用随机的方式谋逆若干次实验，到最终状态时即可得到当前模拟所得的分数
Backpropagation，根据子节点若干次模拟的的得分更新当前子节点的模拟次数与得分值

4、假设你是抖音的技术负责人，强化学习在信息流推荐中会有怎样的作用，如果要进行使用强化学习，都有哪些要素需要考虑，简要说明强化学习在信息流推荐中的应用，有自己的观点。

短视频推荐中过引入强化学习，有助于每一个用户迅速发现喜欢的商品，提高人与商品之间的匹配效率与匹配精度。对抖索结果进行排序以及优化。
短视频推荐中由于互联网数据数据量大，用户层次很多，需要系统作出对反应速度更快，也需要实时数据流。

5、在自动驾驶中，如何使用强化学习进行训练，请说明简要的思路，简要说明强化学习在自动驾驶中的应用，有自己的观点

在自动驾驶场景中，利用摄像头、定位等收集到的图像、位置信息作为训练数据作为特征，将能否顺利到达目的地、是否安全、驾驶体验是否舒适等因素考虑列入奖励函数的因素，优化每一次行驶的命令，达到自动驾驶强化学习的目的。
	


Action：
棋盘大小 10 * 10 采用强化学习（策略价值网络），用AI训练五子棋AI，请说明都有哪些模块，不同模块的原理

AI = Policy Value Network + MCTS

1、Policy Value Network，策略价值网络
策略网络，输入当前的状态，神经网络输出在这个状态下采取每个动作的概率；
价值网络，对于价值网络，当前局面的价值=对终局的估计。
用来指导MCTS搜索并计算叶子节点

2、MCTS，蒙特卡洛树搜索
可以提供很好的策略改善，它的输入是个普通的策略（normal policy），我们可以通过MCTS得到一个更好的策略（good policy）输出 通过MCTS完成自我对弈，从而更新策略网络
树结构：树结构定义了一个可行解的解空间，每一个叶子节点到根节点的路径都对应了一个解（solution）
蒙特卡洛方法：MSTC不需要事先给定打标样本，随机统计方法充当了驱动力的作用，通过随机统计实验获取观测结果
